app/controllers/posts_controller.rb

  def show
    @post=Post.all.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]